In [1]:
import pandas as pd
import numpy as np

In [2]:
cols = ['TransactionID', 'ClientID', 'Profession', 'Bank_dep', 'Risk', 'Number of credits', 'Revenue']

In [3]:
row_1 = [1,231,'Self-employed', '009', 'High', 2, 30200]
row_2 = [2,765,'students','005','high',3,12700]
row_3 = [3,453,'Horeca','007','medium',5,89400]
row_4 = [4,231,'self-employed','009','high',2,30200]
row_5 = [5,892,'finance','003','low',3,740000]

In [4]:
data = pd.DataFrame([row_1,row_2,row_3,row_4,row_5], columns=cols)

In [5]:
data.head()

,TransactionID,ClientID,Profession,Bank_dep,Risk,Number of credits,Revenue
0,1,231,Self-employed,009,High,2,30200
1,2,765,students,005,high,3,12700
2,3,453,Horeca,007,medium,5,89400
3,4,231,self-employed,009,high,2,30200
4,5,892,finance,003,low,3,740000

In [19]:
# Dummy Encoder
pd.get_dummies(data)

,TransactionID,ClientID,Number of credits,Revenue,Profession_Horeca,Profession_Self-employed,Profession_finance,Profession_self-employed,Profession_students,Bank_dep_003,Bank_dep_005,Bank_dep_007,Bank_dep_009,Risk_High,Risk_high,Risk_low,Risk_medium
0,1,231,2,30200,0,1,0,0,0,0,0,0,1,1,0,0,0
1,2,765,3,12700,0,0,0,0,1,0,1,0,0,0,1,0,0
2,3,453,5,89400,1,0,0,0,0,0,0,1,0,0,0,0,1
3,4,231,2,30200,0,0,0,1,0,0,0,0,1,0,1,0,0
4,5,892,3,740000,0,0,1,0,0,1,0,0,0,0,0,1,0

In [20]:
#LabelEncoder
from sklearn.preprocessing import LabelEncoder

In [22]:
label_encode = LabelEncoder()
label_encode.fit_transform(data['Profession'])

array([1, 4, 0, 3, 2])

In [24]:
label_encode.transform(data['Profession'])

array([1, 4, 0, 3, 2])

In [23]:
label_encode.fit(data['Profession'])

LabelEncoder()

In [27]:
data['Profession_labels']=label_encode.fit_transform(data['Profession'])
data.head()

,TransactionID,ClientID,Profession,Bank_dep,Risk,Number of credits,Revenue,Profession_labels
0,1,231,Self-employed,009,High,2,30200,1
1,2,765,students,005,high,3,12700,4
2,3,453,Horeca,007,medium,5,89400,0
3,4,231,self-employed,009,high,2,30200,3
4,5,892,finance,003,low,3,740000,2

In [29]:
#OrdinalEncoder
#Given a dataset with two features, we let the encoder find the unique values per feature and transform the data to an ordinal encoding.
from sklearn.preprocessing import OrdinalEncoder

In [32]:
enc = OrdinalEncoder()
X = [['students', 1], ['Horeca', 2]]
enc.fit(X)
OrdinalEncoder()

OrdinalEncoder()